app/controllers/forecasts_controller.rb

  def index
    @forecasts = Forecast.all
---
SELECT * FROM `forecasts` WHERE (`forecasts`.user_id = 2)

  def update
    respond_to do |format|
      if @forecast.update(forecast_params)
---
UPDATE `forecasts` SET `home_goals` = 1, `result` = 'Visitante', `updated_at` = '2010-06-06 16:31:09', `away_goals` = 4 WHERE `id` = 17

    def set_forecast
      @forecast = Forecast.find(params[:id])
---
SELECT * FROM `forecasts` WHERE (`forecasts`.`id` = 1)