app/controllers/games_controller.rb

SELECT * FROM `games` WHERE (`games`.`id` = 1)
---
  def show
    @game = Game.find(params[:id])

SELECT * FROM `teams` WHERE (`teams`.`id` = 1)
SELECT * FROM `games` WHERE (`games`.`id` = 1)
---
  def edit
    @teams = Team.find(:all, :order => 'name ASC').collect {|t| [ t.name, t.id ] }
    @game = Game.find(params[:id])

SELECT * FROM `games` WHERE (`games`.`id` = 1)
UPDATE `games` SET `home_goals` = 1, `result` = 'tie', `updated_at` = '2010-06-06 17:32:00', `away_goals` = 1 WHERE `id` = 1
---
  def update
    @game = Game.find(params[:id])

    respond_to do |format|
      if @game.update_attributes(params[:game])