app/controllers/site_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
---
  def index
    @users = User.find(:all, :order => 'second_correct_score DESC')

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def positions
    @users = User.find(:all, :order => 'correct_score DESC')

SELECT * FROM `users` WHERE (`users`.`nick` = 'etagwerker') LIMIT 1
---
  def forecasts
    user = User.find_by_nick(params[:user])