app/controllers/teams_controller.rb

SELECT * FROM `groups` WHERE (`groups`.`id` = 9)
---
  def index
    @groups = Group.find(:all)