app/controllers/teams_controller.rb

SELECT * FROM `teams` WHERE (`teams`.group_id = 9)
---
  def index
    @teams = Team.all