app/controllers/users_controller.rb

INSERT INTO `users` (`score`, `updated_at`, `nick`, `admin`, `password`, `email`, `created_at`) VALUES(NULL, '2010-06-05 22:10:41', 'etagwerker2', NULL, 'test123', 'er@etagwerker.com', '2010-06-05 22:10:41')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 3) LIMIT 1
---
    def set_user
      @user = User.find(params[:id])